Repository: gonzalo2099/kate-kwrite-admin-access
Catalog: po/*/kwrite.po
Languages: he

# NAME OF TRANSLATORS
source: Your names
he: צוות התרגום של KDE ישראל

# EMAIL OF TRANSLATORS
source: Your emails
he: kde-l10n-he@kde.org

source: &File
he: &קובץ

source: &Edit
he: &עריכה

source: &View
he: &תצוגה

source: &Tools
he: &כלים

source: &Settings
he: &הגדרות

source: &Help
he: &עזרה

source: Main Toolbar
he: סרגל־הכלים הראשי

source: Use this command to close the current document
he: השתמש בפקודה זו כדי לסגור את המסמך הנוכחי

source: Use this command to create a new document
he: השתמש בפקודה זו ליצירת מסמך חדש

source: Use this command to open an existing document for editing
he: השתמש בפקודה זו לפתיחת מסמך קיים לעריכה

source: This lists files which you have opened recently, and allows you to easily open them again.
he: זוהי רשימת הקבצים אשר נפתחו לאחרונה, ומאפשרת לך לפותחם שוב בקלות.

source: &New Window
he: &חלון חדש

source: Create another view containing the current document
he: צור תצוגה נוספת הכוללת את המסמך הנוכחי

source: Close the current document view
he: סגירת תצוגת המסמך הנוכחי

source: Use this command to show or hide the view's statusbar
he: השתמש בפקודה זו בכדי להציג או להסתיר את שורת המצב של התצוגה

source: Sho&w Path in Titlebar
he: &הצג נתיב בשורת הכותרת

source: Show the complete document path in the window caption
he: הצג את הנתיב המלא של המסמך בכותרת החלון

source: Configure the application's keyboard shortcut assignments.
he: הגדר את שיוכי מקשי הקיצור של יישום זה.

source: Configure which items should appear in the toolbar(s).
he: הגדרת אילו פריטים יופיע בסרגל(י) הכלים

source: &About Editor Component
he: &אודות רכיב העריכה

source: Open File
he: פתיחת קובץ

source: This will hide the menu bar completely. You can show it again by typing %1.
he: זה יסתיר את שורת התפריטים לגמרי. אתה יכול להראות אותו שוב על ידי לחיצה על %1.

source: Hide menu bar
he: הסתר שורת תפריטים

source: [read only]
he: [קריאה בלבד]

source: Untitled
he: ללא שם

source: KWrite - Text Editor
he: KWrite - עורך טקסט

source: Maintainer
he: מתחזק

source: Core Developer
he: מתכנת ליבה

source: Developer & Highlight wizard
he: מפתח ואשף הדגשת תחביר

source: The cool buffersystem
he: מערכת החוצץ המגניבה

source: The Editing Commands
he: פקודות העריכה

# Credit text for someone that did testing and some other similar things
source: Testing, ...
he: ניסויים, ....

source: Former Core Developer
he: מתכנת ליבה לשעבר

source: KWrite Author
he: המפתח המקורי של KWrite

source: KWrite port to KParts
he: הסבת KWrite ל־KParts

source: KWrite Undo History, Kspell integration
he: היסטורית השחזור של KWrite, הטמעה עם Kspell

source: KWrite XML Syntax highlighting support
he: תמיכה בהדגשת תחביר XML של KWrite

source: Patches and more
he: טלאים ועוד

source: QA and Scripting
he: בקרת איכות ותסרוט

source: Highlighting for RPM Spec-Files, Perl, Diff and more
he: הדגשת תחביר של RPM specs, Perl, Diff ועוד

source: Highlighting for VHDL
he: הדגשת תחביר של VHDL

source: Highlighting for SQL
he: הדגשת תחביר של SQL

source: Highlighting for Ferite
he: הדגשת תחביר של Ferite

source: Highlighting for ILERPG
he: הדגשת תחביר של ILERPG

source: Highlighting for LaTeX
he: הדגשת תחביר של LaTeX

source: Highlighting for Makefiles, Python
he: הדגשת תחביר של קבצי Makfiles ו־Python

source: Highlighting for Python
he: הדגשת תחביר של Python

source: Highlighting for Scheme
he: הדגשת תחביר של Scheme

source: PHP Keyword/Datatype list
he: רשימת מילות מפתח/טיפוסי נתונים של PHP

# Credit text for someone that helped a lot
source: Very nice help
he: עזרה נחמדה מאוד

source: All people who have contributed and I have forgotten to mention
he: כל האנשים שתרמו ושכחתי להזכיר

source: Set encoding for the file to open.
he: קבע קידוד לפתיחת הקובץ

source: encoding
he: קידוד

source: Navigate to this line.
he: נווט לשורה הזו.

source: line
he: שורה

source: Navigate to this column.
he: נווט לעמודה הזו.

source: column
he: עמודה

source: Read the contents of stdin.
he: קרא את התוכן של הקלט (stdin)

source: The files/URLs opened by the application will be deleted after use
he: הקובץ או הכתובת שתפתח על ידי היישום ימחק לאחר השימוש

source: Documents to open.
he: מסמך לפתיחה.

source: [urls...]
he: [כתובות...]

source: The file '%1' could not be opened: it is not a normal file, it is a folder.
he: אין אפשרות לפתוח את הקובץ "%1": זה אינו קובץ רגיל, זוהי תיקייה.
